tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bash"
brew "bat"
brew "clang-format"
brew "direnv"
brew "entr"
brew "flyctl"
brew "fzf"
brew "gh"
brew "go"
brew "hugo"
brew "jq"
brew "difftastic"
brew "node"
brew "protobuf"
brew "starship"
brew "tailscale"
brew "the_silver_searcher"
brew "tmux"
brew "yarn"
brew "zoxide"
cask "alfred"
cask "basictex"
cask "docker"
cask "gimp"
cask "numi"
cask "rectangle"

# Ruby
brew "ruby-install"
brew "chruby"
