tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "buf"
brew "cfssl"
brew "clang-format"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "docker", link: false
brew "docker-compose"
brew "eksctl"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "pmix"
brew "open-mpi"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "go@1.18"
brew "golang-migrate"
brew "gpgme"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "gum"
brew "htop"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "istioctl"
brew "jq"
brew "kubectx"
brew "minikube"
brew "node"
brew "node@22", link: true
brew "openslide"
brew "openssl@1.1"
brew "perl"
brew "pgvector"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "postgresql@15"
brew "pre-commit"
brew "prettier"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.9"
brew "rclone"
brew "redis", restart_service: :changed
brew "ruby"
brew "sd"
brew "sqlc"
brew "sslscan"
brew "starship"
brew "tailscale"
brew "tailwindcss"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vips"
brew "virtualenv"
brew "watch"
brew "yarn"
brew "yq"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "mongodb/brew/mongodb-community"
cask "1password-cli"
cask "dbeaver-community"
cask "docker-desktop"
cask "gcloud-cli"
cask "gimp"
cask "next"
cask "ngrok"
cask "numi"
